<script setup>
    const races = 
[
    {
        "id":"human", 
        "name":"Человек", 
        "suboptions": [{
                "id":"half-orc",
                "name":"Нитолец",
                "description":`
                    <h3>Люди</h3>
                    <p>Из всех цивилизованных народов, люди наиболее привычны. А самые частые из них это <code>нитольцы</code>, <code>сарольцы</code> и <code>нерланцы</code>. Хотя бывает, что встречаются и другие. <em>Спросите у ведущего, если хотите играть за какую нибудь редкую культуру людей.</em></p>
                    <h4 id="нитольцы" tabindex="-1"><a class="header-anchor" href="#нитольцы"><span>Нитольцы</span></a></h4>
                    <div class="div-with-image"><img alt="Нитольцы" src="/img/ancestry/nithel.png" align="right" class="anc-img" photo-swipe="" style="cursor: zoom-in;"><p>Нитольцы считают, что Селания мало чем отличается от их континента. Может быть раньше, это и было правдой, но теперь она мало чем напоминает своего соседа. Тем не менее <code>селанцы</code> и <code>нитольцы</code> схожи между собой больше всего. Часто, нитольцы бегут сюда от проблем, долгов или скуки. И быстро приживаются тут, менее чем за десяток лет превращаясь в местного.</p><p>Темноволосые, экспрессивные индивидуалисты. Уже тысячи лет их можно встретить во всех городах этого региона.</p><p>От нитольцев ожидают резкости, самодостаточности, эгоистичности.</p></div>
                `,
            }, {
                "id":"half-orc",
                "name":"Саролец",
                "description":`
                    <h3>Люди</h3>
                    <p>Из всех цивилизованных народов, люди наиболее привычны. А самые частые из них это <code>нитольцы</code>, <code>сарольцы</code> и <code>нерланцы</code>. Хотя бывает, что встречаются и другие. <em>Спросите у ведущего, если хотите играть за какую нибудь редкую культуру людей.</em></p>
                    <h4 id="сарольцы-фероры" tabindex="-1"><a class="header-anchor" href="#сарольцы-фероры"><span>Сарольцы (фероры)</span></a></h4>
                    <div class="div-with-image"><img alt="Фероры" src="/img/ancestry/saroja.png" align="right" class="anc-img" photo-swipe="" style="cursor: zoom-in;"><p>Так же часто тут можно встретить и <code>сарольцев</code> — загадочных южан с длинными именами и яркой одеждой (себя они называют <code>фероры</code>) родом из земель по ту сторону морей. Как Нитэль отделён от Селании морем и без кораблей туда попасть можно только через горы. Так и Сароха отделена от Селании жаркой безлюдной пустыней. Немногие решаются путешествовать этим путём.</p><p>Пришедшие из-за пустыни они принесли часть своей культуры и обычаев в Селанию. И теперь тут практикуют их загадочные магические ритуалы и верования. Но, несмотря на это, они остались закрытой группой. Мало информации о них проникает за пределы общин.</p><p>От сарольцев ожидают формальности, вежливости, скрытности, манипуляций.</p></div>
                `,
            }, {
                "id":"half-orc",
                "name":"Нерландец",
                "description":`
                    <h3>Люди</h3>
                    <p>Из всех цивилизованных народов, люди наиболее привычны. А самые частые из них это <code>нитольцы</code>, <code>сарольцы</code> и <code>нерланцы</code>. Хотя бывает, что встречаются и другие. <em>Спросите у ведущего, если хотите играть за какую нибудь редкую культуру людей.</em></p>
                    <h4 id="нерланцы" tabindex="-1"><a class="header-anchor" href="#нерланцы"><span>Нерланцы</span></a></h4>
                    <div class="div-with-image"><img alt="Нерланцы" src="/img/ancestry/nerland.png" align="right" class="anc-img" photo-swipe="" style="cursor: zoom-in;"><p>Кроме нитольцев и сарольцев тут живут и <code>нерланцы</code> — могучие дикари с северной стороны гор. Чтобы добраться до Селании, им приходится преодолевать огромные горные хребты, или путешествовать долгие месяцы по морю. Так что появляются они тут реже других.</p><p>Физически грубые, сильные они принимаются за самые разные сложные работы. Часто среди них встречаются отличные ремесленники, многие работают кузнецами или плотниками. Но ещё чаще встречаются среди ни те, кто берёт в руки оружие.</p><p>От других их отличает высокий рост, светлые волосы и кожа, простая одежда, грубый акцент. Как и дварфы они ценят договоры, поэтому и те и другие высокого мнения друг о друге.</p><p>От нерланцев ожидают простоты, прямоты, преданности долгу.</p></div>
                `,
           }, {
                "id":"half-orc",
                "name":"Полуорк",
            }, {
                "id":"half-elf",
                "name":"Полуэльф",
            }],
    }, {
        "id":"halfling",
        "name":"Полурослик",
        "description":`
            <h3 id="полурослики" tabindex="-1"><a class="header-anchor" href="#полурослики"><span>Полурослики</span></a></h3>
            <div class="div-with-image"><img alt="Халфлинги" src="/img/ancestry/halfling.png" align="right" class="anc-img" photo-swipe="" style="cursor: zoom-in;"><p>У <code>халфлингов</code> (или <code>полурослики</code>) есть традиция в юности путешествовать по миру. Поэтому их можно встретить по всему побережью внутреннего и южного моря. Где они с возрастом обживаются и оставляют путешествия. Часто их можно встретить в тавернах, пекарнях, рынках. Слабее людей, они восполняют этот недостаток своей удачливостью и мудростью. Со стороны они могут показаться наивными и по-детски доверчивыми, однако на самом деле полурослики довольно наблюдательные и рассудительные.</p><p>От <code>полуросликов</code> ожидают доверчивости, простоты, добродушия. Из-за их размера и характера, многие могут не воспринимать полуросликов в серьёз.</p></div>
        `,
    }, {
        "id":"dwarf",
        "name":"Дварф",
        "suboptions": [{
            "id":"dwarf",
            "name":"Дварфские горы",
            "description":`
<h3 id="дварфы" tabindex="-1"><a class="header-anchor" href="#дварфы"><span>Дварфы</span></a></h3>
<h4 id="дварфские-горы" tabindex="-1"><a class="header-anchor" href="#дварфские-горы"><span>Дварфские горы</span></a></h4>
<div class="div-with-image"><img alt="Дварфы" src="/img/ancestry/dwarf1.png" align="right" class="anc-img" photo-swipe="" style="cursor: zoom-in;"><p>Дварфские горы отгораживают нерланцев от нитольцев. И местные <code>дварфы</code> торгуют и общаются с обоими народами. Встречаются эти дварфы и в Селании. Социально активные, они часто создают торговые или производственные гильдии. Перевозят инструменты или металлические руды.</p><p>От <code>западных дварфов</code> ожидают твёрдости слова, педантичности, расчётливости, гордости, самолюбия, надменности. И, как и для всех дварфов, для них большая честь, быть полезным своему клану.</p></div>
            `,
        }, {
            "id":"dwarf",
            "name":"Длинные горы",
            "description":`
<h3 id="дварфы" tabindex="-1"><a class="header-anchor" href="#дварфы"><span>Дварфы</span></a></h3>
<h4 id="длинные-горы" tabindex="-1"><a class="header-anchor" href="#длинные-горы"><span>Длинные горы</span></a></h4>
<div class="div-with-image"><img alt="Дварфы" src="/img/ancestry/dwarf2.png" align="right" class="anc-img" photo-swipe="" style="cursor: zoom-in;"><p>Вторая половина дварфской цивилизации — <code>дварфы дальних гор</code> — расположена севернее Селании за дикими лесами. Разделение произошло из-за какой-то прошлой катастрофы и теперь это часть сильно отличается от другой. Опасность региона, войны с зеленокожими, отсутствие культуры торговли и политических связей с людьми сделало северных дварфов более резкими во всех аспектах характера. Мало кто видел северного дварфа без доспехов или оружия, готового к использованию. Сильные и выносливые они страдают от недостатка харизмы, отталкивая других от себя.</p><p>От <code>северных дварфов</code> ожидают твёрдости слова, педантичности, скупости, вспыльчивости, ксенофобии. И, как и все дварфы, они очень дорожат связями со своим кланом.</p></div>
            `,
        }],
    }, {
        "id":"rat",
        "name":"Крысолюд",
        "description":`
            <h3 id="солтес" tabindex="-1"><a class="header-anchor" href="#солтес"><span>Солтес</span></a></h3>
            <div class="div-with-image"><img alt="Чульти" src="/img/ancestry/rat.png" align="right" class="anc-img" photo-swipe="" style="cursor: zoom-in;"><p>Крысолюды, или <code>солти</code> встречаются во всех крупных селанских городах. Меньшие чем люди, они быстро заполняют целые кварталы, в которых, после этого, стараются не появляться представители других происхождений. Крысолюды часто терпят пренебрежительное отношение. Однако они обладают живым умом, тягой к знаниям и экспериментам. И хоть многие из них предпочитают жизнь в тесных общинах, бывают и те, кто желает вырваться из тесных объятий своего народа.</p><p>От других их отличает выразительная внешность, размер. Количество мелких вещей и инструментов, которые они часто таскают с собой.</p><p>От солти ожидают суетни, навязчивости, смекалки, игнорирования некоторых человеческих социальных норм.</p></div>
        `,
    }, {
        "id":"lizard",
        "name":"Ящер",
        "description":`
            <h3 id="скальцы" tabindex="-1"><a class="header-anchor" href="#скальцы"><span>Скальцы</span></a></h3>
            <div class="div-with-image"><img alt="Ящеролюды" src="/img/ancestry/lizard.png" align="right" class="anc-img" photo-swipe="" style="cursor: zoom-in;"><p><code>Скальцы</code> (ящеролюды) встречаются в прибрежной Селании, чаще ближе к западу. Родом из далёких земель по ту сторону двух морей, они не так часто встречаются тут. Частично из-за этого местные обитатели испытывают недоверие и иногда даже страх перед ними. Их лишённые человеческой мимики лица вносят в это немалый вклад. Общество ящеров довольно разнообразно, но в Селании чаще других оказываются путешественники, охранники и моряки. Из-за этого у местных есть представление об их свирепости и силе.</p><p>От <code>ящеролюдов</code> ожидают свирепости, силы, холодности, невыразительности эмоций.</p></div>
        `,
    }, {
        "id":"gnome",
        "name":"Гном",
        "description":`
            <h3 id="гномы" tabindex="-1"><a class="header-anchor" href="#гномы"><span>Гномы</span></a></h3>
            <div class="div-with-image"><img alt="Гномы" src="/img/ancestry/gnome.png" align="right" class="anc-img" photo-swipe="" style="cursor: zoom-in;"><p><code>Гномы</code> встречаются в неожиданных местах по всему миру. Много кто относится к ним с недоверием, потому что никто не знает, чего от них можно ожидать. И редкий гном похож на другого гнома. Они мало привязаны к традициям и обществу, гораздо больше их связывает с природой или местностью в которой они родились. В остальном гномы часто слепо следуют своим временным желаниям, быстро теряя или меняя объекты интереса.</p><p>Внешне они меньше халфлингов, с кожей разной расцветки и волосами самых разных форм. Но всегда длиннющими бровями.</p><p>От <code>гномов</code> ожидают непостоянности, опрометчивости, легкомыслия, экспрессивности, бесстрашия.</p></div>
        `,
    },
]
    import { ref } from 'vue'
    //const races = require('./classes/races.json')
  const picked = ref(undefined)
</script>

<template>
    <h2>Выбор расы и культуры</h2>
    <div class="race-container">        
        <div class="race-list">
            <ul>
                <li v-for="race in races" :key="race.id">
                    <input type="radio" :id="race.id" id="race" :value="race" v-model="picked" v-if="!race.suboptions" />
                    <label :for="race.id">{{ race.name }}</label>
                    <ul>
                        <li v-for="option in race.suboptions" :key="option.id">
                            <input type="radio" :id="option.id" id="race" :value="option" v-model="picked" />
                            <label :for="option.id">{{ option.name }}</label>
                        </li>
                    </ul>
                </li> 
            </ul>
        </div>
        <div v-if="!!picked">
            <div v-html="picked.description">
            </div>
        </div>
    </div>
</template>

<style>
ul {
    list-style-type: none;
    padding-inline-start: 16px!important;
}

li label {
    margin-left: 4px;
}

.race-container {
    display: flex;
}

.race-list {
    padding-right: 16px;
    margin-top: 32px;
    min-width: fit-content;
}
</style>
